
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	// {{ нетология
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровУслугУслуги.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугУслуги.Количество КАК Количество,
		|	РеализацияТоваровУслугУслуги.Сумма КАК Сумма
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|ГДЕ
		|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугУслуги.Номенклатура = &Номенклатура";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Номенклатура", Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Не Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Клиент = Контрагент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = Выборка.Количество;
		Движение.СуммаКОплате = Выборка.Сумма;
	Иначе
		Движения.ОбработкаЗаказов.Записывать = Истина;
		Движения.ОстаткиТоваров.Записывать = Истина;
		
		Движение = Движения.ОбработкаЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Заказ = Основание;
		Движение.СуммаОтгрузки = СуммаДокумента;
	
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.Количество = ТекСтрокаТовары.Количество;
		КонецЦикла;	
	КонецЕсли; 
	
//	Движения.ОбработкаЗаказов.Записывать = Истина;
//	Движения.ОстаткиТоваров.Записывать = Истина;
//	
//	Движение = Движения.ОбработкаЗаказов.Добавить();
//	Движение.Период = Дата;
//	Движение.Контрагент = Контрагент;
//	Движение.Договор = Договор;
//	Движение.Заказ = Основание;
//	Движение.СуммаОтгрузки = СуммаДокумента;
//
//	Для Каждого ТекСтрокаТовары Из Товары Цикл
//		Движение = Движения.ОстаткиТоваров.Добавить();
//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//		Движение.Период = Дата;
//		Движение.Контрагент = Контрагент;
//		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
//		Движение.Сумма = ТекСтрокаТовары.Сумма;
//		Движение.Количество = ТекСтрокаТовары.Количество;
//	КонецЦикла;
	// нетология }}
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// {{ нетология
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		НепроверяемыеРеквизиты = Новый Массив;
		НепроверяемыеРеквизиты.Добавить("СуммаДокумента");
		НепроверяемыеРеквизиты.Добавить("Основание");
		ПроверяемыеРеквизиты.Добавить("Услуги");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	КонецЕсли;
	// нетология }}
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ВыполнитьАвтозаполнение(СтрокаДанных = Неопределено) Экспорт
	Отказ = Ложь;
	УслугаАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	УслугаРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	Если Не (ЗначениеЗаполнено(УслугаАбонентскаяПлата) И ЗначениеЗаполнено(УслугаРаботыСпециалиста)) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнены данные по абонентской плате и работам специалиста, заполнение реализации невозможно");
		Отказ = Истина;
	КонецЕсли;
	Товары.Очистить();
	Услуги.Очистить();
	Если СтрокаДанных = Неопределено Тогда
		РеквизитыДоговора = Новый Структура;
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВКМ_ДатаНачала, ВКМ_ДатаОкончания, ВКМ_АбонентскаяПлата");
		ДатаНачала = РеквизитыДоговора.ВКМ_ДатаНачала;
		ДатаОкончания = РеквизитыДоговора.ВКМ_ДатаОкончания;
		АбонентскаяПлата = РеквизитыДоговора.ВКМ_АбонентскаяПлата;
		Если Дата < ДатаНачала Или Дата > ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю("Дата документа вне срока действия договора, заполнение реализации невозможно");
			Отказ = Истина;
		КонецЕсли;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;	
		ЗапросРабот = Новый Запрос;
		ЗапросРабот.Текст = "ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0)) КАК КоличествоЧасов,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0)) КАК СуммаКОплате,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода,, Клиент = &Клиент
		|	И Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент";
		ЗапросРабот.УстановитьПараметр("Клиент", Контрагент);
		ЗапросРабот.УстановитьПараметр("Договор", Договор);
		ЗапросРабот.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		ЗапросРабот.УстановитьПараметр("КонецПериода", КонецДня(КонецМесяца(Дата)));
		Выборка = ЗапросРабот.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НовыеДанные = Услуги.Добавить();
			НовыеДанные.Номенклатура = УслугаРаботыСпециалиста;
			НовыеДанные.Количество = Выборка.КоличествоЧасов;
			НовыеДанные.Цена = Выборка.СуммаКОплате / Выборка.КоличествоЧасов;
			НовыеДанные.Сумма = Выборка.СуммаКОплате;
		КонецЕсли;
	Иначе
		АбонентскаяПлата = СтрокаДанных.АбонентскаяПлата;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтрокаДанных);
		Дата = СтрокаДанных.КонецМесяца;
		Если СтрокаДанных.Количество > 0 Тогда 
			НовыеДанные = Услуги.Добавить();
			НовыеДанные.Номенклатура = УслугаРаботыСпециалиста;
			НовыеДанные.Количество = СтрокаДанных.Количество;
			НовыеДанные.Сумма = СтрокаДанных.Сумма;
			НовыеДанные.Цена = НовыеДанные.Сумма / НовыеДанные.Количество;
		КонецЕсли;
	КонецЕсли;
	Если АбонентскаяПлата > 0 Тогда
		НовыеДанные = Услуги.Добавить();
		НовыеДанные.Номенклатура = УслугаАбонентскаяПлата;
		НовыеДанные.Количество = 1;
		НовыеДанные.Цена = АбонентскаяПлата;
		НовыеДанные.Сумма = АбонентскаяПлата;
	КонецЕсли;
	Если Услуги.Количество() = 0 Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Абонентская плата и работы за %1 года отсутствуют, заполнение реализации невозможно", Формат(Дата, "ДФ='MMMM yyyy';")));
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока УслугиОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
