
#Область ПрограммныйИнтерфейс

// Обходит справочник ВКМ_Уведомления, передает процедуре ОтправитьСообщениеБоту текст уведомлений,
// после чего очищает справочник.
Процедура ВКМ_ОтправкаУведомлений() Экспорт
	ВыборкаСправочник = Справочники.ВКМ_Уведомления.Выбрать();
	Пока ВыборкаСправочник.Следующий() Цикл	
		СправочникОбъект = ВыборкаСправочник.ПолучитьОбъект();
		Отправлено = ОтправитьСообщениеБоту(СправочникОбъект.ТекстСообщения);
		Если Отправлено Тогда
			СправочникОбъект.Удалить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Отправляет чат боту новые и измененные заявки клиентов.
// Для вызова из регламентного задания ВКМ_ОтправкаУведомлений
// Параметры:
// ТекстСообщения - Строка
Функция ОтправитьСообщениеБоту(ТекстСообщения)
	Хост = "api.telegram.org";
	Порт = 443;
	Защита = Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение(Хост, Порт, , , , 60, Защита);
	Запрос = Новый HTTPЗапрос("/bot8963658858:AAHq1Yo6fFvZVRIHGyh_N0IjLkDdV3dT4_s/sendMessage");
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	СообщениеВЧат = Новый Структура;
	СообщениеВЧат.Вставить("chat_id", "-1004378221582");
	СообщениеВЧат.Вставить("text", ТекстСообщения);
	Запрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(СообщениеВЧат));
	
	Ответ = Соединение.Получить(Запрос);
	Если Ответ.КодСостояния = 200 Тогда
	    Чтение = Новый ЧтениеJSON;
	    Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	    Результат = ПрочитатьJSON(Чтение);
	    Чтение.Закрыть();
	    Если Результат.ok Тогда
	        ОбщегоНазначения.СообщитьПользователю("Сообщение успешно отправлено!");
	        Успех = Истина;
	    Иначе
	         ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Ошибка от Telegram: %1", Результат.error_message));
	         Успех = Ложь;
	    КонецЕсли;
	Иначе
    	 ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Сетевая ошибка: %1, %2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку()));
    	 Успех = Ложь; 	 
	КонецЕсли;
	Возврат Успех;
КонецФункции

#КонецОбласти