#language: ru

@tree

Функционал: Запуск обработки массовое создание реализаций под учетной записью с правами бухгалтера

Как бухгалтер я хочу
массово создать или перерасчитать и провести документы реализаация товаров и услуг
на основе документов обслуживание клиентов за заданный в обработке период 
чтобы сократить время обработки документов   

Контекст:
	Дано я подключаю TestClient "TestClient" логин "Бухгалтер1" пароль ""

Сценарий: Запуск обработки массовое создание реализаций
	И В командном интерфейсе я выбираю "Обслуживание клиентов" "Массовое создание реализаций"
	Тогда открылось окно "Массовое создание реализаций"
	И я нажимаю кнопку выбора у поля с именем 'Период'
	Тогда открылось окно "Выберите период"
	И в поле с именем 'DateBegin' я ввожу текст "01.01.2026"
	И в поле с именем 'DateEnd' я ввожу текст "31.12.2026"
	И я нажимаю на кнопку с именем 'Select'
	Тогда открылось окно "Массовое создание реализаций"
	И в таблице 'СписокДоговоров' я нажимаю на кнопку с именем 'СписокДоговоровСформироватьРеализации'
	И Я закрываю окно "Массовое создание реализаций"
