#language: ru

@tree

Функционал: Внесение актуальных данных о проведенных работах под учетной записью с правами специалиста

Как специалист я хочу
учесть время отработанное у клиента, внести подтверждающие документы 
чтобы получить оплату за работы   

Контекст:
	Дано я подключаю TestClient "TestClient" логин "Специалист1" пароль ""

Сценарий: Внесение данных в документ обслуживание клиента и его проведение
	И В командном интерфейсе я выбираю "Обслуживание клиентов" "Обслуживание клиентов"
	Тогда открылось окно "Обслуживание клиентов"
	И в таблице 'Список' в дополнение формы с именем 'СписокСтрокаПоиска' я ввожу текст "00007"
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно "Обслуживание клиента * от *"
	И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
	И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыОписаниеРабот' я ввожу текст "Работы1"
	И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыЧасовФакт'
	И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасовФакт' я ввожу текст "1"
	И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыЧасовКОплате'
	И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасовКОплате' я ввожу текст "1"
	И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
	И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
	И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыОписаниеРабот' я ввожу текст "Работы2"
	И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыЧасовФакт'
	И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасовФакт' я ввожу текст "2"
	И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыЧасовКОплате'
	И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасовКОплате' я ввожу текст "1"
	И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
	И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
	И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыОписаниеРабот' я ввожу текст "Работы3"
	И в таблице 'ВыполненныеРаботы' я активизирую поле с именем 'ВыполненныеРаботыЧасовФакт'
	И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыЧасовФакт' я ввожу текст "1"
	И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
	И В текущем окне я нажимаю кнопку командного интерфейса "Присоединенные файлы"
	И я выбираю файл 'C:\VA\Tests\ОбслуживаниеКлиентовМенеджер.feature'
	И я нажимаю на кнопку с именем 'ДобавитьИзФайлаНаДиске'
	И В текущем окне я нажимаю кнопку командного интерфейса "Основное"
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна "Обслуживание клиента * от * *" в течение 20 секунд
	