#language: ru

@tree

Функционал: Создание и проведение документа Обслуживание клиента под учетной записью с правами менеджера

Как Менеджер я хочу
Сформировать документ Обслуживание клиентов 
чтобы Специалист мог получить информацию о предстоящих работах   

Контекст:
	Дано я подключаю TestClient "TestClient" логин "Менеджер1" пароль ""

Сценарий: Проведение нового документа Обслуживание клиентов
	И В командном интерфейсе я выбираю "Обслуживание клиентов" "Обслуживание клиентов"
	Тогда открылось окно "Обслуживание клиентов"
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно "Обслуживание клиента (создание)"
	И из выпадающего списка с именем 'Клиент' я выбираю по строке "Абонент1"
	И из выпадающего списка с именем 'Договор' я выбираю по строке "Договор обслуживания 1"
	И из выпадающего списка с именем 'Специалист' я выбираю по строке "Специалист1"
	И в поле с именем 'ДатаПроведенияРабот' я ввожу текст "12.10.2026"
	И в поле с именем 'ВремяНачалаРаботПлан' я ввожу текст " 9:00:00"
	И в поле с именем 'ВремяОкончанияРаботПлан' я ввожу текст "13:00:00"
	И в поле с именем 'ОписаниеПроблемы' я ввожу текст "Работы"
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	Тогда открылось окно "Обслуживание клиента * от *"
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна "Обслуживание клиента * от * *" в течение 20 секунд
	