#language: ru

@tree

Функционал: Формирование отчета анализ выставленных актов
Как бухгалтер я хочу
проверить расхождения в суммах между документами обслкживание клиентов и документами реализация товаров и услуг за определенный период 
чтобы обеспечить выставление счетов за все работы по обслуживанию клиентов за период   

Контекст:
	Дано я подключаю TestClient "TestClient" логин "Бухгалтер1" пароль ""

Сценарий: Формирование отчета анализ выставленных актов и сравнение его с эталоном
И В командном интерфейсе я выбираю "Добавленные объекты" "Анализ актов"
Тогда открылось окно "Основной"
И я устанавливаю флаг с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Использование'
И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение'
Тогда открылось окно "Выберите период"
И в поле с именем 'DateBegin' я ввожу текст "01.05.2026"
И в поле с именем 'DateEnd' я ввожу текст "31.08.2026"
И я нажимаю на кнопку с именем 'Select'
Тогда открылось окно "Основной"
И я нажимаю на кнопку с именем 'СформироватьОтчет'
Тогда табличный документ 'ОтчетТабличныйДокумент' равен:
	| 'Параметры:'             | 'Период: 01.05.2026 - 31.08.2026' | ''               | ''               |
	| ''                       | ''                                | ''               | ''               |
	| 'Клиент'                 | 'Абонентская плата'               | 'Сумма к оплате' | 'Часов к оплате' |
	| 'Договор'                | ''                                | ''               | ''               |
	| 'Абонент1'               | '20 000,00'                       | '8 000,00'       | '8'              |
	| 'Договор обслуживания 1' | '20 000,00'                       | '8 000,00'       | '8'              |
	| 'Абонент2'               | '10 000,00'                       | '12 000,00'      | '6'              |
	| 'Договор обслуживания 2' | '10 000,00'                       | '12 000,00'      | '6'              |
	| 'Абонент3'               | '15 000,00'                       | '5 000,00'       | '5'              |
	| 'Договор обслуживания 3' | '15 000,00'                       | '5 000,00'       | '5'              |
	| 'Итого'                  | '45 000,00'                       | '25 000,00'      | '19'             |

