#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Параметры.Свойство("АдресДанных") И ЭтоАдресВременногоХранилища(Параметры.АдресДанных) Тогда
        Данные = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);
        Год = Формат(Данные.Год, "ДФ=yyyy;");
        Отпуска = Данные.Отпуска;
        График.Очистить();
        График.Обновление = Ложь;
        График.ОбластьЗаголовка.Текст = СтрШаблон("Отпуска за %1 год", Год);
        Серия = График.Серии.Добавить();
        Серия.Текст = "План";
        Для Каждого СтрокаДанных Из Отпуска Цикл
        	Точка = График.УстановитьТочку(СтрокаДанных.Сотрудник);
        	Точка.Текст = СтрокаДанных.Сотрудник;
			Значение = График.ПолучитьЗначение(Точка, Серия);
			Интервал = Значение.Добавить();
			Интервал.Начало = СтрокаДанных.ДатаНачала;
			Интервал.Конец = СтрокаДанных.ДатаОкончания;
        КонецЦикла;
        График.Обновление = Истина;	
    КонецЕсли;
КонецПроцедуры
#КонецОбласти