
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СформироватьРеализации(Команда)
	Объект.СписокДоговоров.Очистить();
	ДлительнаяОперация = СформироватьРеализацииНаСервере();
  	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
  	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФормирования", ЭтотОбъект);
  	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	// СписокРеализаций = СформироватьРеализацииНаСервере(); 
	// ЗаполнитьТЧ(СписокРеализаций);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьРеализацииНаСервере()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
  	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
	"ВКМ_ДлительныеОперацииВызовСервера.МассовоеСозданиеРеализаций", Объект.Период);
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФормирования(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда 
	    Возврат;
	КонецЕсли;
	Если Результат.Статус = "Ошибка" Тогда
	 	ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	    Возврат;
	КонецЕсли;
	ДанныеТЧ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	ЗаполнитьТЧ(ДанныеТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(ДанныеТЧ)
	Для Каждого СтрокаДанных Из ДанныеТЧ Цикл
		НоваяСтрока = Объект.СписокДоговоров.Добавить();
		НоваяСтрока.Договор = СтрокаДанных.Договор;
		НоваяСтрока.Реализация = СтрокаДанных.Реализация;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти