
#Область ПрограммныйИнтерфейс

// Выводит элементы в форме.
// Для вызова из обработчика формы ПриСозданииНаСервере.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//
//
Процедура ДобавитьЭлементы(Форма) Экспорт
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		УстановкаОтбора(Форма.Элементы.Договор);
		Команда = Форма.Команды.Добавить("ВКМ_КомандаЗаполнитьРеализацию");
        Команда.Заголовок = "Заполнить";
        Команда.Действие = "ВКМ_КомандаЗаполнитьРеализацию";
        КнопкаФормы = Форма.Элементы.Вставить("КнопкаЗаполнить", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
		КнопкаФормы.ИмяКоманды = "ВКМ_КомандаЗаполнитьРеализацию";
		КнопкаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Позволяет выбирать договоры с видом Абонентское обслуживание в форме РеализацияТоваровУслуг.
//
// Параметры:
//   Элемент - ПолеФормы
//   
//
Процедура УстановкаОтбора(Элемент)
	ПараметрыВыбора = Новый Массив;
	ЗначенияОтбора = Новый Массив;
	ЗначенияОтбора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	ЗначенияОтбора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Покупатель);
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ЗначенияОтбора));
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
КонецПроцедуры
#КонецОбласти
