#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// {{ нетология 2026.06.01
	ВКМ_ДобавитьЭлементы();
	// нетология }}
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// {{ нетология 2026.06.01
	ВКМ_УстановитьВидимостьГруппы(Элементы.ГруппаСрокДействия);
	ВКМ_УстановитьВидимостьГруппы(Элементы.ГруппаОплата);
	// нетология }}
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	// {{ нетология 2026.06.01
	ВКМ_УстановитьВидимостьГруппы(Элементы.ГруппаСрокДействия);
	ВКМ_УстановитьВидимостьГруппы(Элементы.ГруппаОплата);
	// нетология }}
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ДобавитьЭлементы()
	ВКМ_ДобавитьГруппу("ГруппаСрокДействия");
	ВКМ_ДобавитьГруппу("ГруппаОплата");
	ВКМ_ВставитьЭлемент("ВКМ_ДатаНачала", Элементы.ГруппаСрокДействия);
	ВКМ_ВставитьЭлемент("ВКМ_ДатаОкончания", Элементы.ГруппаСрокДействия);
	ВКМ_ВставитьЭлемент("ВКМ_АбонентскаяПлата", Элементы.ГруппаОплата);
	ВКМ_ВставитьЭлемент("ВКМ_СтоимостьЧасаРаботы", Элементы.ГруппаОплата);
КонецПроцедуры

&НаСервере
Процедура ВКМ_ДобавитьГруппу(ИмяГруппы)
	Группа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
КонецПроцедуры

&НаСервере
Процедура ВКМ_ВставитьЭлемент(ИмяЭлемента, РодительЭлемента)
	ПолеВвода = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), РодительЭлемента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = СтрШаблон("Объект.%1", ИмяЭлемента);
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_УстановитьВидимостьГруппы(Группа)
	ВидимостьГруппы = (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	Группа.Видимость = ВидимостьГруппы;	
КонецПроцедуры
#КонецОбласти
