#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	ЕстьДвижения = СформироватьОсновныеНачисления(); 
	Если Не ЕстьДвижения Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	РассчитатьОклад();
	РассчитатьОтпускные();
	СформироватьУдержания();
	РассчитатьУдержания();
	ЗаполнитьВзаиморасчетыССотрудниками();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция СформироватьОсновныеНачисления()
	ЕстьДвижения = Истина; 
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.ДатаНачала КАК ДатаНачала,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.ДатаОкончания КАК ДатаОкончания,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|	Пользователи.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТ_Документ
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработнойПлаты.Начисления КАК ВКМ_НачислениеЗаработнойПлатыНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВКМ_НачислениеЗаработнойПлатыНачисления.Сотрудник = Пользователи.Ссылка
		|ГДЕ
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Документ.Сотрудник КАК Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
		|	ВТ_Документ.ВидРасчета КАК ВидРасчета,
		|	ВТ_Документ.ДатаНачала КАК ПериодДействияНачало,
		|	ВТ_Документ.ДатаОкончания КАК ПериодДействияКонец,
		|	ВТ_Документ.ГрафикРаботы КАК ГрафикРаботы,
		|	ВТ_Документ.Подразделение КАК Подразделение
		|ИЗ
		|	ВТ_Документ КАК ВТ_Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник В
		|			(ВЫБРАТЬ
		|				ВТ_Документ.Сотрудник КАК Сотрудник
		|			ИЗ
		|				ВТ_Документ КАК ВТ_Документ)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = ВТ_Документ.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ЕстьДвижения = Ложь;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.Подразделение) Тогда
			ОбщегоНазначения.СообщитьПользователю(Стршаблон("Сотруднику %1 не назначено подразделение, проведение документа невозможно", Выборка.Сотрудник));
			ЕстьДвижения = Ложь;
		КонецЕсли;
		Если Выборка.Оклад = Null Тогда
			ОбщегоНазначения.СообщитьПользователю(Стршаблон("У сотрудника %1 отсутствует оклад, проведение документа невозможно", Выборка.Сотрудник));
			ЕстьДвижения = Ложь;  
		КонецЕсли;
		Если Не ЕстьДвижения Тогда
			Продолжить;
		КонецЕсли;
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
				Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Движение.ПериодДействияНачало, -12));
				Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Движение.ПериодДействияНачало, -1));
			КонецЕсли;
	КонецЦикла;
	Если ЕстьДвижения Тогда
		Движения.ВКМ_ОсновныеНачисления.Записать();
	КонецЕсли;
	Возврат ЕстьДвижения;	
КонецФункции

Процедура РассчитатьОклад()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки - 1 КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботы.СуммаКОплате, 0) КАК СуммаКОплате
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
		|	И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад)) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы КАК ВКМ_ВыполненныеСотрудникомРаботы
		|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник
		|		И ВКМ_ВыполненныеСотрудникомРаботы.Период
		|			МЕЖДУ ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействияНачало И ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействияКонец";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки];
		Если Выборка.План = 0 Тогда
			Движение.Сумма = Выборка.СуммаКОплате;
			Возврат;
		КонецЕсли;
		Движение.Сумма = Выборка.СуммаКОплате + Движение.Оклад * Выборка.Факт / Выборка.План;
	КонецЦикла;
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
КонецПроцедуры

Процедура РассчитатьОтпускные()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки - 1 КАК НомерСтроки,
		|	РАЗНОСТЬДАТ(ОсновныеНачисленияБазаОсновныеНачисления.ПериодДействияНачало,
		|		ОсновныеНачисленияБазаОсновныеНачисления.ПериодДействияКонец, ДЕНЬ) + 1 КАК ФактДней,
		|	ОсновныеНачисленияБазаОсновныеНачисления.СуммаБаза КАК СуммаБаза,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеБазовыйПериод, 0) КАК ЗначениеБазовыйПериод,
		|	ОсновныеНачисленияБазаОсновныеНачисления.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,, Регистратор = &Ссылка
		|	И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)) КАК ОсновныеНачисленияБазаОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
		|		И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО ОсновныеНачисленияБазаОсновныеНачисления.Сотрудник = ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник"; 

	Измерения = Новый Массив;				
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Измерения",Измерения); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Движения.ВКМ_ОстаткиОтпусков.Записать();
	Движения.ВКМ_ОстаткиОтпусков.Записывать = Истина;
	Пока Выборка.Следующий()  Цикл 
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки];
		Движение.Сумма = ?(Выборка.ЗначениеБазовыйПериод = 0, 0, Выборка.СуммаБаза / Выборка.ЗначениеБазовыйПериод * Выборка.ФактДней);
		Движение = Движения.ВКМ_ОстаткиОтпусков.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Год = Год(Дата);
		Движение.Регистратор = Ссылка;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ДнейОтпуска = Выборка.ФактДней;
	КонецЦикла;	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);	
КонецПроцедуры

Процедура СформироватьУдержания()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ОсновныеНачисления.Сумма) КАК Сумма,
		|	НАЧАЛОПЕРИОДА(ВКМ_ОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ) КАК БазовыйПериодНачало,
		|	КОНЕЦПЕРИОДА(ВКМ_ОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ) КАК БазовыйПериодКонец
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Сотрудник,
		|	ВКМ_ОсновныеНачисления.Регистратор,
		|	НАЧАЛОПЕРИОДА(ВКМ_ОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ),
		|	КОНЕЦПЕРИОДА(ВКМ_ОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;
	Движения.ВКМ_Удержания.Записать();
КонецПроцедуры

Процедура РассчитатьУдержания()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.СуммаБаза КАК СуммаБаза,
		|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки - 1 КАК НомерСтроки
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,, Регистратор = &Регистратор) КАК
		|		ВКМ_УдержанияБазаВКМ_ОсновныеНачисления";
	
	Измерения = Новый Массив;				
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки];
		Движение.Сумма = Выборка.СуммаБаза * 0.13;
	КонецЦикла;
	Движения.ВКМ_Удержания.Записать(, Истина);

КонецПроцедуры

Процедура ЗаполнитьВзаиморасчетыССотрудниками()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ВКМ_ОсновныеНачисления.Сумма) КАК СуммаНачислено,
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_Удержания.Сумма КАК СуммаУдержано
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_ОсновныеНачисления.Сотрудник = ВКМ_Удержания.Сотрудник
		|		И ВКМ_Удержания.Регистратор = ВКМ_ОсновныеНачисления.Регистратор
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Сотрудник,
		|	ВКМ_Удержания.Сумма";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.СуммаНачислено - Выборка.СуммаУдержано; 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
#КонецЕсли