
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	ЧасовКОплатеПоДокументу = ВыполненныеРаботы.Итог("ЧасовКОплате");
	ЧасовФактПоДокументу = ВыполненныеРаботы.Итог("ЧасовФакт");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачала КАК ДатаНачала,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончания КАК ДатаОкончания,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,	
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
	|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Дата", ДатаПроведенияРабот);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Неверный вид договора: %1, проведение документа невозможно", Выборка.ВидДоговора)); 
	КонецЕсли;
	Если ДатаПроведенияРабот < Выборка.ДатаНачала Или ДатаПроведенияРабот > Выборка.ДатаОкончания Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Дата проведения работ должна лежать между %1 и %2, проведение документа невозможно", Выборка.ДатаНачала, Выборка.ДатаОкончания));
	КонецЕсли;
	Если Выборка.ПроцентОтРабот = Null Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не указан процент выплаты от работ для сотрудника %1, проведение документа невозможно", Специалист));
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьПриход();
	Движение.Период = ДатаПроведенияРабот;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ЧасовКОплатеПоДокументу;
	Движение.СуммаКОплате = ЧасовКОплатеПоДокументу * Выборка.СтоимостьЧасаРаботы;
	
	// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.Период = ДатаПроведенияРабот;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = ЧасовФактПоДокументу;
	Движение.СуммаКОплате = ЧасовФактПоДокументу * Выборка.СтоимостьЧасаРаботы * Выборка.ПроцентОтРабот / 100;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЭтоНовый() Тогда
		Сообщение = СтрШаблон("%1 к %2 назначены работы у клиента %3, исполнитель %4", ДатаПроведенияРабот, ВремяНачалаРаботПлан, Клиент, Специалист);
	Иначе
		СтарыеДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"ДатаПроведенияРабот, ВремяНачалаРаботПлан, Клиент, Специалист");
		ЕстьИзменения = (СтарыеДанные.ДатаПроведенияРабот <> ДатаПроведенияРабот Или СтарыеДанные.ВремяНачалаРаботПлан <> ВремяНачалаРаботПлан Или СтарыеДанные.Клиент <> Клиент Или СтарыеДанные.Специалист <> Специалист);
		Если ЕстьИзменения Тогда
			СтароеСообщение = СтрШаблон("%1 к %2 назначены работы у клиента %3, исполнитель %4",
										 Формат(СтарыеДанные.ДатаПроведенияРабот, "ДЛФ=D;"),
										 Формат(СтарыеДанные.ВремяНачалаРаботПлан, "ДЛФ=T;"), 
										 СтарыеДанные.Клиент, 
										 СтарыеДанные.Специалист); 
			Сообщение = СтрШаблон("Внесены изменения в сообщение %1,", СтароеСообщение);
			Сообщение = СтрШаблон("%1 новые вводные: %2 к %3 назначены работы у клиента %4, исполнитель %5",
									 Сообщение,
									 Формат(ДатаПроведенияРабот, "ДЛФ=D;"),
									 Формат(ВремяНачалаРаботПлан, "ДЛФ=T;"), 
									 Клиент, 
									 Специалист);
		КонецЕсли;
	КонецЕсли;
	Уведомление = Справочники.ВКМ_Уведомления.СоздатьЭлемент();
	Уведомление.ТекстСообщения = Сообщение;
	Уведомление.Записать();
КонецПроцедуры

#КонецОбласти
#КонецЕсли