
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПересчитатьОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьОтпуска();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ПересчитатьОтпуска();
	Элемент.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)
    АдресДанных = ПодготовитьДанныеДляПередачи();
    ПараметрыОткрытия = Новый Структура("АдресДанных", АдресДанных);
    ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьОтпуска()
	ОтпускаСотрудников = Новый Соответствие; 
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Строка.ДнейОтпуска = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400;
		ВсегоДней = ОтпускаСотрудников.Получить(Строка.Сотрудник);
		Если ВсегоДней = Неопределено Тогда
			ВсегоДней = Строка.ДнейОтпуска;
		Иначе
			ВсегоДней = ВсегоДней + Строка.ДнейОтпуска;
		КонецЕсли;
		ОтпускаСотрудников.Вставить(Строка.Сотрудник, ВсегоДней);
	КонецЦикла;
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Строка.ДнейОтпуска = ОтпускаСотрудников.Получить(Строка.Сотрудник);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДляПередачи()
    СтруктураДанных = Новый Структура;
    СтруктураДанных.Вставить("Год", Объект.Год);
    СтруктураДанных.Вставить("Отпуска", Объект.ОтпускаСотрудников.Выгрузить());
    Возврат ПоместитьВоВременноеХранилище(СтруктураДанных, УникальныйИдентификатор);
КонецФункции
#КонецОбласти