
#Область ПрограммныйИнтерфейс
// Создает реализации в случае их отсутствия исходя из данных регистра ВыполненныеКлиентуРаботы за период.
// Для вызова из обработки ВКМ_МассовоеСозданиеРеализаций
// Возвращаемое значение: 
// Массив из Структура 
// Параметры:
// Период - СтандартныйПериод
Функция МассовоеСозданиеРеализаций(Период) Экспорт
	ТаблицаМесяцев = Новый ТаблицаЗначений;
	ТаблицаМесяцев.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ТекущаяДата = Период.ДатаНачала;
	КонечнаяДата = Период.ДатаОкончания;
	Пока ТекущаяДата < КонечнаяДата Цикл
		СтрокаДаты = ТаблицаМесяцев.Добавить();
		СтрокаДаты.Дата = ТекущаяДата;
		ТекущаяДата = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, 1));
	КонецЦикла;	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Дата КАК Дата
	|ПОМЕСТИТЬ ВТМесяцы
	|ИЗ
	|	&ТаблицаМесяцев КАК ТаблицаМесяцев
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата,
	|	ВТМесяцы.Дата КАК НачалоМесяца,
	|	КОНЕЦПЕРИОДА(ВТМесяцы.Дата, МЕСЯЦ) КАК КонецМесяца
	|ПОМЕСТИТЬ ВТПлатаПомесячно
	|ИЗ
	|	ВТМесяцы КАК ВТМесяцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВТМесяцы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ДатаНачала,
	|			МЕСЯЦ) И КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ДатаОкончания, МЕСЯЦ)
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ВИДЫДОГОВОРОВКОНТРАГЕНТОВ.ВКМ_АБОНЕНТСКОЕОБСЛУЖИВАНИЕ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПлатаПомесячно.Договор КАК Договор,
	|	ВТПлатаПомесячно.Организация КАК Организация,
	|	ВТПлатаПомесячно.Контрагент КАК Контрагент,
	|	ВТПлатаПомесячно.ВКМ_АбонентскаяПлата КАК АбонентскаяПлата,
	|	ВТПлатаПомесячно.НачалоМесяца КАК НачалоМесяца,
	|	ВТПлатаПомесячно.КонецМесяца КАК КонецМесяца,
	|	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
	|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате, 0)) КАК Сумма
	|ИЗ
	|	ВТПлатаПомесячно КАК ВТПлатаПомесячно
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТПлатаПомесячно.Договор = РеализацияТоваровУслуг.Договор
	|		И РеализацияТоваровУслуг.Дата МЕЖДУ ВТПлатаПомесячно.НачалоМесяца И ВТПлатаПомесячно.КонецМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|		ПО ВТПлатаПомесячно.Договор = ВКМ_ВыполненныеКлиентуРаботы.Договор
	|		И ВКМ_ВыполненныеКлиентуРаботы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ ВТПлатаПомесячно.НачалоМесяца И ВТПлатаПомесячно.КонецМесяца
	|СГРУППИРОВАТЬ ПО
	|	ВТПлатаПомесячно.Договор,
	|	ВТПлатаПомесячно.Организация,
	|	ВТПлатаПомесячно.Контрагент,
	|	ВТПлатаПомесячно.ВКМ_АбонентскаяПлата,
	|	ВТПлатаПомесячно.НачалоМесяца,
	|	ВТПлатаПомесячно.КонецМесяца,
	|	РеализацияТоваровУслуг.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоМесяца";
		
	Запрос.УстановитьПараметр("ТаблицаМесяцев", ТаблицаМесяцев);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТекущиеДанные = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.РеализацияСсылка) Тогда
				РеализацияОбъект = Выборка.РеализацияСсылка.ПолучитьОбъект();
				РеализацияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Иначе
				РеализацияОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			КонецЕсли;
			РеализацияОбъект.ВКМ_ВыполнитьАвтозаполнение(Выборка);
			РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаТаблицы = Новый Структура;
			СтрокаТаблицы.Вставить("Договор", Выборка.Договор);
			СтрокаТаблицы.Вставить("Реализация", РеализацияОбъект.Ссылка);
			ТекущиеДанные.Добавить(СтрокаТаблицы);
	КонецЦикла;
	Возврат ТекущиеДанные;
КонецФункции

#КонецОбласти

