#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыплатаЗаработнойПлатыВыплаты.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ВыплатаЗаработнойПлатыВыплаты.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_ДокументВыплаты
		|ИЗ
		|	Документ.ВКМ_ВыплатаЗаработнойПлаты.Выплаты КАК ВКМ_ВыплатаЗаработнойПлатыВыплаты
		|ГДЕ
		|	ВКМ_ВыплатаЗаработнойПлатыВыплаты.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыплатаЗаработнойПлатыВыплаты.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокументВыплаты.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ_ДокументВыплаты.Сумма) КАК СуммаПоДокументу,
		|	СУММА(ЕСТЬNULL(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток, 0)) КАК СуммаОстаток
		|ИЗ
		|	ВТ_ДокументВыплаты КАК ВТ_ДокументВыплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, Сотрудник В
		|			(ВЫБРАТЬ
		|				ВТ_ДокументВыплаты.Сотрудник КАК Сотрудник
		|			ИЗ
		|				ВТ_ДокументВыплаты КАК ВТ_ДокументВыплаты)) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
		|		ПО ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник = ВТ_ДокументВыплаты.Сотрудник
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДокументВыплаты.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		Если Выборка.СуммаПоДокументу > Выборка.СуммаОстаток Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Сумма к выплате превышает долг перед сотрудником %1, проведение документа невозможно", Выборка.Сотрудник));
			Продолжить;
		КонецЕсли;
		Если Не Отказ Тогда
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.Сумма = Выборка.СуммаПоДокументу;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли